N = int(input())
dp = [[0] * 10 for _ in range(N)]
# 첫줄은 0 빼고 다 계단수 가능
dp[0] = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1]
# 두번째 줄부터는 윗줄의 왼쪽과 오른쪽을 더한 값으로 채우는데 0과 9는 한쪽만 있으므로 예외처리
for i in range(1, N):
    for j in range(10):
        if j == 0:
            dp[i][j] = dp[i-1][j+1]
        elif j == 9:
            dp[i][j] = dp[i-1][j-1]
        else:
            dp[i][j] = dp[i-1][j-1] + dp[i-1][j+1]

print(sum(dp[N - 1]) % 1000000000)
'''
N == 1:
1 * 9 - 0
answer = 9
1 ~ 9
----------------
N == 2:
2 * 9 - 1
answer = 17
10 12
21 23
...
87 89
98
----------------
N == 3:
4 * 9 - 4
answer = 32
101 121 123
210 212 232 234
323 321 343 345
...
765 767 789 787 
878 879 898 
987 989
----------------
N == 4:
8 * 9 - 7
answer = 65
----------------
N == 5:
16 * 9 - 28
answer = 116
----------------
N == 6:
32 * 9 - 66
answer = 222
'''