'''
N = 1
빈칸 1 / 왼쪽 1 / 오른쪽 1
3가지

N = 2
빈칸 3 / 왼쪽 2 / 오른쪽 2
7가지

N = 3
빈칸 7 / 왼쪽 5 / 오른쪽 5
17가지

N = 4
빈칸 17 / 왼쪽 12 / 오른쪽 12
41가지

빈칸 = dp[i - 1][0]
1. 왼쪽 = dp[i - 1][0] + dp[i - 1][1]
2. 오른쪽 = dp[i - 1][0] + dp[i - 1][1])
양쪽 = (dp[i - 1][0] + dp[i - 1][1] // 2) * 2
'''

N = int(input())

# 빈칸/양쪽 ver. 맞왜틀???
# dp = [[0, 0] for _ in range(N + 1)]
# dp[1][0], dp[1][1] = 1, 2
# for i in range(2, N + 1):
#     dp[i][0] = sum(dp[i - 1]) % 9901
#     dp[i][1] = ((dp[i - 1][0] + dp[i - 1][1] // 2) * 2) % 9901

# 빈칸/왼쪽/오른쪽 ver.
dp = [[0, 0, 0] for _ in range(N + 1)]
dp[1][0] = dp[1][1] = dp[1][2] = 1
for i in range(2, N + 1):
    dp[i][0] = sum(dp[i - 1]) % 9901
    dp[i][1] = dp[i][2] = (dp[i - 1][0] + dp[i - 1][1]) % 9901

# print(dp)
print(sum(dp[N]) % 9901)